#+TITLE: Values Tree Analysis
#+AUTHOR: jwalsh
#+DATE: 2025-05-01
#+OPTIONS: toc:3 num:t

* Initial Data Exploration

Let's take a first look at the data:

#+begin_src shell
head -n 5 data/values_tree.csv
#+end_src

#+RESULTS:
: cluster_id,description,name,level,parent_cluster_id,pct_total_occurrences
: balanced wisdom,,balanced wisdom,0,ai_values:l1:0167e96f-fb3d-4461-8c4f-dcc1c39ec145,0.001
: contemplative wisdom,,contemplative wisdom,0,ai_values:l1:0167e96f-fb3d-4461-8c4f-dcc1c39ec145,0.002
: experiential wisdom,,experiential wisdom,0,ai_values:l1:0167e96f-fb3d-4461-8c4f-dcc1c39ec145,0.003
: inner wisdom,,inner wisdom,0,ai_values:l1:0167e96f-fb3d-4461-8c4f-dcc1c39ec145,0.004

Count total rows:

#+begin_src shell
wc -l data/values_tree.csv
#+end_src

#+RESULTS:
:     3604 data/values_tree.csv

* Filter Out AI Values

Filter out rows where cluster_id starts with "ai_values:":

#+begin_src shell
grep -v '^ai_values:' data/values_tree.csv > data/filtered_values.csv
echo "Filtered out ai_values: prefix rows"
wc -l data/filtered_values.csv
#+end_src

#+RESULTS:
: Filtered out ai_values: prefix rows
:     3308 data/filtered_values.csv

* Load into SQLite

Create and populate a SQLite database:

#+begin_src shell :tangle scripts/setup_db.sh :mkdirp yes
# Create SQLite database
sqlite3 data/values.db <<EOF
.mode csv
.import data/values_tree.csv values_tree
CREATE INDEX idx_cluster_id ON values_tree (cluster_id);
CREATE INDEX idx_pct_occurrences ON values_tree (pct_total_occurrences);
.quit
EOF
echo "Loaded data into SQLite database"
#+end_src

#+RESULTS:
: Loaded data into SQLite database

Create filtered views in SQLite:

#+begin_src sql :engine sqlite :db data/values.db :results table :tangle sql/values-filtered.sql :mkdirp yes
-- Create filtered view excluding ai_values
CREATE VIEW IF NOT EXISTS filtered_values AS
SELECT * FROM values_tree 
WHERE cluster_id NOT LIKE 'ai_values:%'
ORDER BY pct_total_occurrences DESC;

-- Create top 20% view
CREATE VIEW IF NOT EXISTS top_values AS
SELECT * FROM filtered_values
LIMIT (SELECT CAST(COUNT(*) * 0.2 AS INTEGER) FROM filtered_values);
#+end_src

